In [6]:
import pandas as pd

In [8]:
titanic_df=pd.read_csv("titanic_train.csv")
print("titanic 변수 type:",type(titanic_df))
titanic_df.head(3)
# print("DataFrame의 크기 : ",titanic_df.shape) # 891개의 로우와 12개의 컬럼
# titanic_df.info() # None값 알수 있고 타입 알수 있다.
# titanic_df.describe() # 평균, 표준편차, 최솟값, 최댓값, 사분위수

titanic 변수 type: <class 'pandas.core.frame.DataFrame'>

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
# df[Series] Series형태로 특정 칼럼 데이터 셋 반환 
value_counts=titanic_df['Pclass'].value_counts() # 데이터 분포 확인할때 매우 유용 자주 쓰임
print(value_counts)
titanic_pclass=titanic_df['Pclass']
print(type(titanic_pclass))

3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
# 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기
import numpy as np
col_name1=["col1"]
list1=[1,2,3]
array1=np.array(list1)
print("array1 shape:",array1)

# 리스트를 이용해 DataFrame 생성
df_list1=pd.DataFrame(list1,columns=col_name1)
print("1차원 리스트로 만든 DataFrame:\n",df_list1)

# 넘파이 ndarray를 이용해 DataFrame 생성
df_array1=pd.DataFrame(array1,columns=col_name1)
print("1차원 ndarray로 만든 DataFrame:\n",df_array1)

array1 shape: [1 2 3]
1차원 리스트로 만든 DataFrame:
    col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFrame:
    col1
0     1
1     2
2     3

In [11]:
import numpy as np
# 2차원 형태의 데이터를 기반으로 DataFrame을 생성
col_name2=["col1","col2","col3"]

# 2X3 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2=[[1,2,3],
      [11,12,13]]
array2=np.array(list2)
print("array2 shape",array2.shape)

# 리스트 -> DataFrame 생성
df_list2=pd.DataFrame(list2,columns=col_name2)
print("\n2차원 리스트로 만든 DataFrame:\n",df_list2)

# ndarray -> DataFrame 생성
df_array2=pd.DataFrame(array2,columns=col_name2)
print("\n2차원 ndarray로 만든 DataFrame:\n",df_array2)

# 딕셔너리로 만든 DataFrame
dict={"col1":[1,11],"col2":[2,12],"col3":[3,13]} # 딕셔너리 만들 때 Key랑 Value값은 "="이 아닌 ":"으로 이루어짐
df_dict=pd.DataFrame(dict) # 변수 지정할때 . 사용 금지!
print("\n딕셔너리로 만든 DataFrame:\n",df_dict)

array2 shape (2, 3)

2차원 리스트로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

2차원 ndarray로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

딕셔너리로 만든 DataFrame:
    col1  col2  col3
0     1     2     3
1    11    12    13

In [12]:
# 많은 머신러닝 패키지가 기본 데이터 형으로 넘파이를 사용함. 그래서 빈번히 변환이 이루어짐!
# 어떤 DataFrame을 써도 다 결과는 같다
# DataFrame을 ndarray로 변환 
# df.values
array3=df_dict.values
print("df_dict.values 타입:",type(array3),"\ndf_dict.values shape:",array3.shape)
print(array3)

# DataFrame을 리스트로 변환
# df.values.tolist()
list3=df_dict.values.tolist()
print("\ndf_dict.values.tolist() 타입:",type(list3))
print(list3)

# DataFrame을 딕셔너리로 변환
# df.to_dic("list")
dict3=df_dict.to_dict("list")
print("\ndf_dict.to.dict() 타입:",type(dict3))
print(dict3)

df_dict.values 타입: <class 'numpy.ndarray'>
df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 12 13]]

df_dict.values.tolist() 타입: <class 'list'>
[[1, 2, 3], [11, 12, 13]]

df_dict.to.dict() 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 12], 'col3': [3, 13]}

In [13]:
# 새로운 컬럼 데이터 생성
titanic_df["Age_0"]=0
titanic_df["Age_by_10"]=titanic_df["Age"]*10
titanic_df["Family_No"]=titanic_df["SibSp"]+titanic_df["Parch"]+1  # Series 안에 큰 따옴표
titanic_df.head(3)

# 데이터 삭제
# inplace=False defalut값이다. 변수로 반환될 때 원본 데이터는 제거되지 않음
titanic_drop_df=titanic_df.drop("Age_0",axis=1)
titanic_drop_df.head(3)

drop_result=titanic_df.drop(["Age_0","Age_by_10","Family_No"],axis=1,inplace=True)
print("inplace=True로 drop후 반환된 값",drop_result)
# ⚠️ inplace=True 할때 객체변수를 쓰면 다 날라간다. ⚠️ (titanic_df=titanic_df_drop 하지 말란말이다!)
titanic_df.head(3)

# 로우 삭제
print("### before axis 0 drop ###")
print(titanic_df.head(3))
titanic_df.drop([0,1,2],axis=0,inplace=True)
print("### after axis 0 drop ###")
print(titanic_df.head(3))

inplace=True로 drop후 반환된 값 None
### before axis 0 drop ###
   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
### after axis 0 drop ###
   PassengerId  Survived  Pclass  \
3            4         1       1
4            5         0       3
5            6         0       3

                                           Name     Sex   Age  SibSp  Parch  \
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0
4                      Allen, Mr. William Henry    male  35.0      0      0
5                              Moran, Mr. James    male   NaN      0      0

   Ticket     Fare Cabin Embarked
3  113803  53.1000  C123        S
4  373450   8.0500   NaN        S
5  330877   8.4583   NaN        Q